Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN, BLUE.tmx
Source language: id
Languages: en

source: berat banget pikiranmu
en: those are heavy thoughts.

source: sebenarnya hari itu aku menemukan kacamata persis milikmu
en: I did find the glasses that looked very similar to yours.

source: Sebenarnya aku tidak pernah lupa wujud manusiaku
en: actually, I never forgot my human form.

source: kok jelek sih mba hasilnya?
en: why is the result so bad?

source: ohok! ohok!
en: khoff! khoff!

source: hah..?
en: huh...?

source: buat apa aku mati kalau nanti jadi sepertimu?
en: i thought, what if i ended up like you after i died?

source: aku mengurus anak pertama mereka bernama Radi
en: I helped taking care of radi, their first child.

source: CTIK
en: click

source: ..jangan pergi
en: ...don’t go away.

source: ini banyak barang bawaan, tolong bantuin dong
en: we need help carrying all of these things

source: contohnya kunti yang dijembatan
en: you know, the one at the bridge.

source: dan dari musik ini juga dia kenal riana, calon istrinya sekarang!
en: through music, he met riana, his now fiancee.

source: apa?
en: what?

source: ngga ngapa-ngapain
en: i’ll do nothing.

source: eh cogan!
en: how handsome!

source: mulai dari band rock, pop, sampe religi..
en: he played many genres. rock, pop, and even gospel.

source: seumur hidup aku ngga pernah menggubris hantu-hantu di sekitarku..
en: I’ve never really thought about all of the ghosts I’ve encountered.

source: oh, pantesan wujudnya tidah aneh-aneh..!
en: that explains why he resembled humans so much!

source: takut membawamu ke ingatan buruk lagi
en: or reminding you of your painful experiences.

source: Kalau ketemu tuhan bisa ngga ya nego biar aku bisa tinggal di atas langit hehe
en: do you think i could ask god to let me live in the sky when i meet him? hehe

source: halah gitu doang
en: that’s nothing

source: apa kamu ingat kata-kata terakhirnya?
en: do you remember the last thing he said?

source: ayah thr*!
en: dad, give me my THR*!

source: aku.. melihatmu
en: well, i saw you.

source: kak juni!
en: juni!

source: mau disuapin?
en: want me to feed you?

source: duluan ya ka!
en: hi there!

source: oh... kayaknya lagi banyak tamu ya?
en: oh, I guess you’re having some visitors right now.

source: ini kacamata jim? gak mungkin..
en: are these jimmy’s glasses? it can’t be...

source: setelahnya aku dapat pekerjaan sebagai spg kosmetik di sebuah mall
en: after that, I got a job as cosmetic stall attendant in a mall.

source: aku yang bilang?
en: did I?

source: belum kelihatan juga?
en: have you heard anything about him?

source: itu gitar?
en: is that a guitar?

source: AYO JANJI?
en: promise me...

source: sepenuh hatiku
en: ...with all my heart.

source: Aku senang sekali waktu kalian akhirnya ketemu lagi
en: I was so glad to know the three of you were reunited.

source: jim
en: jimmy.

source: melihatnya lagi?
en: ...see him?

source: setelah itu bagaimana?
en: and what next?

source: ..kenapa juga aku sengaja?
en: why would I do that?

source: tapi udah berbulan-bulan orangnya ngga balik-balik sih..
en: but he hasn’t returned for months.

source: tapi yang pasti, dia teman yang kubanggakan!
en: but, without a doubt, he's a friend I'm proud of!

source: huaakh!
en: waah!

source: kenapa tiba-tiba keingetan itu-
en: why did I rememberi it out of the blue?

source: ini sam ya?
en: is this samuel?

source: sebenarnya kenapa kita ke sini lagi?
en: why are we here again?

source: bagus bukan?
en: that’s a good thing, no?

source: kebetulan sama..?
en: is it coincidence?

source: aku melihatmu dari awal..
en: I noticed you since the beginning.

source: kenapa dulu aku suka kak sam ya..
en: how could even like Sam back then?

source: setelah kuberitahu apa kamu akan tetap berbuat seperti tadi?
en: if I tell you the truth, would you keep doing what you just did?

source: gaada...?
en: it’s not here.

source: bodoamat
en: whatever.

source: kalau dipikir-pikir dari dulu setan yang gentayangan di sekitarku itu sudah biasa
en: come to think of it, i am used to wandering ghosts being around me and all.

source: ciuman!
en: kissing!

source: halah, kamu mau pukul aku kan sebenernya?
en: it’s just your ruse to hit me, right?

source: tapi bajakanya belum ada, harus nonton di bioskop
en: the illegal version isn’t available yet ,only in theater.

source: di dunia setan ada game juga ?
en: ...there could be video games in the underworld?

source: gara-gara aku?
en: because of me?

source: yaampun!!
en: awww!

source: ayo cepetan
en: let’s keep going.

source: kemana sih
en: where the heck...

source: aku selalu merasa... mungkin tuhan lupa mencabut nyawaku juga
en: I’ve always thought that god maybe forgot to take my life as well.

source: *lagu tsubasa
en: captain tsubasa’s song

source: ...aku ini
en: ...is with me?

source: Aku hanya bisa melihat ibuku yang terus-terusan menangis
en: I could only see my mother crying all the time.

source: ngga bisa
en: ...can’t.

source: bangun
en: awake

source: ....pergi ke tempat berhantu
en: visiting haunted places...

source: AYO MAKAN!
en: let’s dig in!

source: dan disini pula aku jatuh cinta lagi
en: during this time, i also fell in love again.

source: jahat banget sih
en: how rude!

source: SEPERTI ITU
en: ...like him.

source: kenapa kamu berhenti waktu mobil itu ada di depanmu?
en: why did you come to a halt in front of a moving vehicle?

source: sudah, sudah
en: there, there

source: masa sih?!!..
en: really?!

source: hmm enak
en: hmm, so delicious!

source: siapa juga yang mau jadi temanmu?
en: you think i want to be your friend?

source: tau apa kamu soal gituan?
en: what do you know about love?

source: malah kecelakaan kereta lagi yang kulihat pertama kali
en: ...I saw a train accident when I first came here.

source: jadi inget damar
en: ...reminded me of damar.

source: h-halo selamat malam..
en: h-hello, good evening.

source: damar yang itu masih hidup
en: that damar is still alive.

source: aku yang tidak lagi hanya melihat aspal abu-abu di depanku...
en: ...I'm no longer just looking at the dreary road ahead of me...

source: tapi masih mau menyambut hangat anak yang ngga bener hidupnya seperti aku dan sam
en: and yet, she still welcomed unruly kids like me and samuel with open arms.

source: hari itu juga kami pergi ke pusat pertokoan di kota ini
en: that day, we went to the shopping center in the city.

source: aku boleh nginep di rumahmu ngga?
en: can I sleep over?

source: tiba-tiba saja ia menjadi segalanya bagiku
en: ...but he suddenly became my everything to me.

source: mohon nyalakan perangkat musik anda
en: please turn on the sound for a better reading experience

source: apa kamu ingat..
en: do you remember...

source: halo juni! aku mau nikah!
en: hello, juni! I’m getting married!

source: kalau ngga tau kenapa menuduhku begitu ?!
en: if you had no idea, why did you accuse me?!

source: pelakunya
en: the culprit

source: bisa kamu telpon tetanggamu dulu selagi aku ke sana?
en: can you call your neighbors while you wait for me?

source: Aku jadi tidak ingin mengungkitnya lagi
en: I didn’t wanna bring it up anymore.

source: melihatmu yang entah makhluk apa bikin aku ngga jadi ingin mati tahu nggak?
en: seeing you who were in a limbo made me lost my will to die, you know?

source: kata yuan aku cantik
en: yuan said I’m pretty.

source: ngga gimana-gimana
en: nothing special.

source: KAYAKNYA YANG KAMU LIHAT BUKAN ORANG DEH...
en: I don’t think the one you’re looking at is a human.

source: ngelantur ya?
en: for real?

source: aku ngga kemana-mana
en: I didn’t go anywhere.

source: benar, kenapa aku harus membantu jim? memangnya dia siapa?
en: yeah, why should I help him out? who does he think he is, anyway?

source: besoknya rumahmu sudah kosong
en: and the next day, your house was empty.

source: kenapa ya?
en: I wonder why.

source: benar
en: you were right.

source: karena rumah kita deketan semua
en: we lived in the same neighborhood.

source: kacamata mahal.. berarti dulu aku kaya..
en: a pricey glasses, does it mean I was loaded?

source: tante om thr !
en: juni, samuel, give me my THR!

source: tolong aku...
en: help me...

source: yaampun kesiangan!!
en: gosh, I slept in!

source: hari itu langit cerah seperti biasanya
en: the sky was so blue, as it always was.

source: hoooek
en: blaaargh

source: bebeng dan sam harus menyelesaikan pekerjaan mereka dulu di jakarta, jadi baru bisa pulang sekarang
en: because bebeng and samuel had to finish their work first in Jakarta, we could only go afterwwards.

source: loh kok ngga sama yuan?
en: why don’t you share the same room with yuan?

source: kalau ngga dipakai mah buat anak saya aja haha
en: if you don’t want it, my son would love to have it.

source: dan aku..
en: and I...

source: dan ketampanan sam juga jadi bukan apa-apa
en: samuel didn't look that handsome anymore here.

source: setannya di punggungmu!!
en: the ghost is riding on your back!

source: juni jangan bengong ayo masuk
en: juni, what are you waiting for? let’s go inside.

source: aku ngga apa-apa
en: I’m totally okay.

source: gaada toko lain?
en: are there no other stores?

source: kupikir tidak ada lagi yang mengingatnya..
en: I thought no one would remember it.

source: MANA SIH...?
en: where is he?

source: SINI GANTIAN
en: my turn, now.

source: tiga pintu di lantai atas untuk kami bertiga
en: we used the three rooms upstairs.

source: eyang aku bawa kue nih
en: I've brought some cookies for you, grandma.

source: Jadi aku menyembunyikan identitasku, aku hanya ingin main lagi dengan kalian, tanpa ada yang khawatir apapun
en: I wished to spend more time with you guys, but I didn’t want you worried about me. so I hid my identity.

source: gue rekomendasiin lagu buat belajar gimana?
en: how about some songs for you to study to?

source: ini
en: here.

source: ternyata aku yang lupa
en: it turned out that I was the one who had forgotten.

source: hahhaha!
en: hahaha!

source: damar teman kalian?
en: ...your friend damar?

source: maklum lah tokonya kecil begitu
en: well, it was a street vendor, y’know.

source: IBU !
en: mom!

source: klak
en: click

source: ha-halo ca..
en: h-hello?

source: haduh, mana keluargaku lagi keluar kota
en: my entire family is out of town, gosh.

source: jim juga baik-baik saja walau ngga tahu apa-apa
en: besides, even if he never knew anything, he'd be okay.

source: di sini sepertinya aku jadi banyak omong kayak bebeng
en: I became a smooth talker like bebeng.

source: atau hanya harapanku
en: or my wishful thinking.

source: kalau kalian.. temanku dulu..?
en: ...that we've known each other?

source: rasanya sakit...?
en: why does it hurt?

source: capek
en: so tired...

source: bebeng ! sam!
en: bebeng, samuel...

source: Aku jadi ingat kecelakaan motor yang kualami sebelum ini
en: then I realized I'd been in a motorcycle accident.

source: gara-gara kamu..
en: because of you...

source: ada
en: yes.

source: petunjuk terakhir jim..
en: the last clue about jimmy…

source: KUPIKIR..
en: I thought...

source: sssk
en: chatter

source: dari kedua orang ini aku belajar cinta dan kasih
en: from these two, i learned about love,

source: bisa-bisanya setan itu berbuat begitu padaku!!
en: the impudence of that little ghost to me!!

source: hm? siapa ‘di sini’?
en: hm? what’s there?

source: aku memang berniat untuk lompat waktu itu
en: I was going to jump into the river that day.

source: gitar?
en: a guitar?

source: aku akhirnya berhasil menyelesaikan sekolahku, tentu saja karena aku punya dua guru di rumah
en: because I lived with two teachers, I was able to complete my education.

source: oh oke bu..
en: coming right up!

source: aku...
en: I...

source: siapa yang mau nonton? ikut
en: can I join you guys too?

source: siapa sangka kan pertemanan ini akan sampai dimana aku melihat anak-anaknya..
en: who would have guessed that we remained friends even after bebeng had children?

source: apa... ingatanku ?
en: or was it my memory?

source: aku hamil
en: I’m pregnant.

source: begitu juga tadi
en: so was earlier.

source: tapi kenapa kamu yang seorang hantu bisa-
en: but how could you, a ghost know--

source: ..untuk mengingatkannya
en: to remind him.

source: sroookk
en: snorttt

source: kalau anak tahun 90an pasti tau hehe
en: ‘90 kids mostly heard of it.

source: surat dari?
en: from whom?

source: bioskop sih paling adanya di kota
en: we only have theaters in the city.

source: *cuma punya dua temen laki2 yang gapernah muji*
en: *she only has two friends who never complimented her*

source: yuan aku bingung nih mau kerja apa, menurutmu gimana?
en: yuan, I don’t know what job should I take. do you have any suggestion?

source: dan teruntuk pembaca blue yang bagai nadi di cerita ini, terima kasih sudah bersama-sama selama setahun ini! semoga kisah mereka dapat bermanfaat pesan-pesannya!
en: and last but not least, thank you to all of blue's readers who have become the life of this story and supporting this comic! I hope the mesage of this story reached your heart.

source: tak!
en: thud!

source: tapi dulu bunda bisa satu lagu
en: but I can play one song.

source: penjualnya bilang kacamata itu milik seseorang bernama... damar?
en: the seller told me that the glasses belonged to a guy named... damar?

source: punya orang itu, lagi saya ganti lensanya
en: someone brought them here to have the lenses replaced.

source: gapernah ya? haha dasar ga laku
en: I bet you haven’t. you poor girl.

source: Sudah bertahun-tahun berlalu sebenarnya aku tidak tahu wajahmu sudah seperti apa, tapi aku ingat sekali rumahmu
en: I haven't seen you in years, and I had no idea what your face would look like. but I remembered your house quite well.

source: ting!
en: wink!

source: setelah beberapa lama akhirnya kami pulang
en: after a while, we finally went home.

source: apa jangan-jangan...
en: don’t tell me...

source: iya juga
en: she’s right.

source: apa karena kecelakaan orang tuamu ?
en: was it because of your parents’ accident?

source: kalo orang liat pasti langsung lariii-!!!
en: anyone who sees this will indeed flee.

source: karena mereka peduli padamu
en: because they genuinely care about you.

source: tante itu semua-
en: are you saying that--

source: aku ngga akan baik-baik saja kalau kamu pergi
en: I wouldn’t be okay if you leave me.

source: ayo pergi ke rumah sakit kemarin!
en: let’s go to the hospital!

source: oke bu
en: okay, mom.

source: aku ngga ingat..
en: I don’t remember it...

source: aku mengantar bebeng dan sam yang mau menjenguk temannya yang habis kecelakaan
en: i accompany bebeng and samuel who wanted to visit their friend who had been in an accident.

source: atau karena aku bertemu dengan orang-orang yang mau gila bersamaku?
en: is it because I found folks who understood my craziness and staying beside me?

source: SEHARUSNYA...
en: she was supposed...

source: ckrek
en: snap

source: k-kok diem..?
en: why is everyone so quiet?

source: Aku ingat awalnya semuanya gelap hanya seperti memejamkan mata, lalu perlahan aku melihat ibuku
en: at first, i only saw darkness, as if both of my eyes were closed, then I began to see my mom.

source: ngga ada
en: he’s not here.

source: tadi temen-temen lamamu tuh..
en: ...your old friends just came to visit you.

source: ep.43- poling
en: ep. 43 - the wandering pocong

source: minggu berganti bulan,
en: ...and weeks turned to months...

source: dan tanpa sadar, aku menikmati hari-hariku
en: unknowingly, I enjoyed my days...

source: IYA DONG!
en: of course!

source: i-itu kan..
en: isn’t that...

source: oh iya bener
en: yeah, you’re right.

source: gak mungkin
en: no way...

source: aku ngga ngerti...
en: I just can’t understand...

source: contohnya kenapa jacknya harus tenggelem, padahal deknya masih muat
en: like, why did jack have to drown when the deck was still spacious enough?

source: yaampun ini rumah apa surga ya? kok banyak bidadarinya
en: is this heaven? where did all the angels come from?

source: yasudah saya terima
en: then I approve of your marriage proposal.

source: *adik-adik bebeng
en: *bebeng’s younger sisters

source: iya
en: yeah.

source: lalu istrinya bebeng,
en: and bebeng’s wife,

source: hati-hati ya
en: take care.

source: berikutnya..
en: afterwards...

source: kenapa jim?
en: what is it, jimmy?

source: kalau mau kamu mungkin bisa sama kunti
en: you can try it with kuntilanak, though.

source: shhhh
en: swish

source: hal pertama yang kulihat adalah hal buruk terakhir yang kuingat
en: the first thing I saw was the last horrible thing I remembered.

source: GIMANA KALAU JADI KELUARGAKU?
en: how about being my family instead?

source: jangan mulai lagi deh
en: don’t start now.

source: kalau aku tidur kamu ngapain?
en: if I take a nap, what will you do?

source: (IG @kennsaty)
en: (instagram: @kennsaty)

source: selain jauh, perjalanan ini juga sedikit aneh
en: our trip was a bit strange as well.

source: hah?
en: what?

source: *lagu titanic
en: *a song from Titanic

source: halo juni?
en: hello, juni?

source: besok kalo kemaleman anterin aku pulang dulu ya
en: please walk me home if we get home too late at night.

source: kamu ngga akan kenapa-kenapa
en: everything is gonna be okay.

source: Jadi aku bersyukur kita berkumpul lagi
en: so i was grateful that we all met again.

source: bebeng makan dulu!
en: bebeng, time to eat!

source: sayang ini bener kan di sini?
en: you want it right here?

source: kamu kenapa ?
en: what's with you?

source: engga
en: no.

source: kamu inget damar teman kita yang dirawat di rumah sakit?
en: remember our friend damar who was at the hospital?

source: mereka menikah saat bebeng sedang kuliah profesi pada tahun 2009
en: they got married in 2009, when bebeng took certification program.

source: KALAH
en: he lost

source: kamu yang menggantung di sini..
en: you didn't nearly fall into the river...

source: gaada kayaknya
en: I think I have no goals.

source: ‘Setelah itu apa yang terjadi?’
en: “what happened, then?”

source: tapi hari pertama kamu datang ke sini terjadi kecelakaan kereta itu lagi
en: but on the first day you came here, a railroad accident happened again.

source: sini biar aku aja
en: lemme do it.

source: kamu kan bisa cerita padaku!
en: you can talk to me, jimmy!

source: haah disaat seperti ini damar malah koma
en: damar is in comma right when we need him.

source: dia mah kebaikan
en: she was being polite.

source: orang-orang menyebutnya poling atau pocong keliling
en: they called it the wandering pocong.

source: ya berarti dia inget!
en: well, that means he remembered!

source: apa cuma halusinasiku?
en: was it just a hallucination?

source: berhasil
en: we did it

source: mana kutahu kalau kalian semua bohong!
en: how would I know that you've been lying to me!

source: ayo pergi
en: let’s go.

source: hii freak banget
en: what a freak!

source: kalau sekarang kamu pergi ke sana sendiri bisa gak?
en: can you go there by yourself now?

source: oh, dia juga berhasil menjadi aktivis
en: and, of course, he became an activist.

source: YA!
en: okay!

source: tapi ternyata besoknya kamu benar-benar hilang..
en: but then, you disappeared the next day.

source: ENGGA MIKIRIN APA-APA KOK
en: it was nothing

source: tapi aku tetap tidak menemukan sosoknya lagi
en: ...but I still haven't seen him.

source: ibu!
en: auntie!

source: krek
en: crack

source: kesabaranku benar-benar diuji di sini...
en: the job required a lot of patience.

source: setelah itu,
en: afterwards...

source: kenapa lis?
en: what is it?

source: pip
en: beep

source: aku takut jim
en: ...because I was scared, jimmy.

source: set
en: fwip

source: Maaf aku ngga bisa pamit denganmu juni
en: sorry that I didn’t get to say goodbye to you.

source: di tengah kuliahnya dia juga masih main musik
en: he still played music while studying.

source: aku merasa jadi lebih sering melihat hantu-hantu di sekitarku
en: ...it felt like i saw ghosts around me more frequently.

source: kasetnya murah kok!
en: It’s not expensive at all!

source: janji..
en: promise me...

source: ah besok deh, bunda kan baru sampai
en: why don’t we go tomorrow? I’ve just arrived.

source: semuanya ia lalui dengan perjuangan
en: he struggled a lot to go through it all.

source: ngga pak, makasih
en: no, thanks.

source: sini kau!!
en: come here!

source: hah??
en: what?

source: tunggu tante..
en: wait, ma’am.

source: iyaa yaampun
en: oh my god!

source: kalau capek tidur aja nanti ku bangunin
en: if you feel too tired, just take a nap. I’ll wake you up.

source: MASA NGGA LIHAT?
en: don’t you see him?

source: caca menikah dengan bu elis saat aku kelas 2 sma
en: caca married ms. elis when I was in grade 11.

source: biar aku bisa selalu melihatmu hidup
en: so that I could watch you from up above.

source: ‘...lalu aku yang sekarang?’
en: “what am I now?”

source: rokoknya kak!
en: would you like to buy?

source: ah...
en: um...

source: tapi tolong itu komputernya diatur dulu
en: but redo your computer’s setting first.

source: tapi akhirnya dia berhasil juga
en: and finally, he made it there.

source: tapi semuanya cuma iseng sih..
en: but it was all just his side hobby.

source: kamu ini sebenarnya siapa?
en: who are you, really?

source: dan tidak lama ia pun melamar bu elis
en: he then proposed to ms. elis not long after.

source: MAKANYA JIN NYA BEGITU
en: that’s why his spirit looks like that.

source: diem aja sampai aku bangun?
en: just staying still until I wake up?

source: lalu...
en: also...

source: rokok ku!
en: my cigarettes!

source: siapa suruh jelek?
en: maybe because you're ugly.

source: tuing
en: swish

source: HAHAH GAYA APA SIH ?
en: the hell are you doing?

source: maaf lahir batin ya bu!
en: eid mubarak, Auntie!

source: ini damar temen sdmu!
en: it’s damar, your friend from elementary school!

source: mana thr-ku, katanya mau dikasih sekarang
en: where’s my THR? you said you’d give me now.

source: atau mungkin kamu sengaja melupakan semuanya
en: ...or maybe you purposefully forgot it all.

source: padahal jawaban yang kucari ada didepanku
en: even though the answers were right before my eyes.

source: untuk sampai sini kami harus naik angkutan umum dulu sebanyak 3 kali... pokoknya lumayan jauh deh
en: we rode public transport and transited three times to get here. it was a long journey.

source: tapi aku malah bertemu denganmu!
en: but i met you instead!

source: tante coba tanya satpam dulu ya
en: wait, let me ask the security.

source: oh merk itu ngga ada mba
en: we don't sell that brand here.

source: hah kenapa semua tambah mahal sih..
en: why is everything getting more expensive?

source: jim!!!
en: jimmy!

source: bundaaa
en: mooommy

source: p-pocong.. itu ? kamu yakin?
en: th-the pocong? you sure?

source: gimana nih?
en: what do I do?

source: oh iya di lemari kamar depan juga masih gitar tuh bu
en: there's also a guitar in the main bedroom’s closet.

source: gatau
en: dunno

source: SWISHH
en: whoosh

source: Kalau kamu tidak mengingatku yang dulu, setidaknya aku ingin kamu ingat aku yang sekarang
en: even if you didn't remember my past self, at least you'd remember my current me.

source: apa karena waktu itu kamu melihat kecelakaan kereta lagi saat pertama datang ke sini?
en: was it because you saw a train accident again the first time you came here?

source: penerus silat cabang keluarga elis
en: a silat gym successor of Elis’ family.

source: aku merasa kalau mobil itu menabrakku itu sudah takdirku
en: I was sure if the car hit me, that would be my destiny.

source: waktu sd kita memang beda kelas semua, tapi kalau sore kita semua temen main
en: we were in different classes during elementary, but we played together after school.

source: rima (22 thn)
en: rima (22 years old)

source: ada yang bilang kamu cantik?
en: there’s someone who really thinks so?

source: udah jangan nangis terus...
en: please, stop crying.
